app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(params_sub)
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Music"], ["room_number", 101], ["created_at", "2021-07-02 18:21:35.154970"], ["updated_at", "2021-07-02 18:21:35.154970"]]